# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]
import math

my_set = [25, 456, 64, -74, -9]
print(my_set)
new_set = []
for unit in my_set:
    if unit > 0:
        if math.sqrt(unit) - int(math.sqrt(unit)) == 0:
            new_set.append(int(math.sqrt(unit)))
print(new_set)

# Задача-2:
# Дана дата в формате dd.mm.yyyy, например: 02.11.2013.
# Ваша задача вывести дату в текстовом виде, например: второе ноября 2013 года.
# Склонением пренебречь (2000 года, 2010 года)
months = {'01': 'января', '02': 'февраля', '03': 'марта', '04': 'апреля',
         '05': 'мая', '06': 'июня', '07': 'июля', '08': 'августа', '09': 'сентября',
         '10':'октября', '11':'ноября', '12':'декабря'
          }
days = {'01': 'первое', '02': 'второе', '03': 'третье', '04': 'четвертое',
        '05': 'пятое', '06': 'шестое', '07': 'седьмое', '08': 'восьмое', '09': 'девятое',
        '10':'десятое', '11':'одиннадцатое', '12':'двенадцатое', '13': 'тринадцатое',
        '14': 'четырнадцатое', '15': 'пятнадцатое', '16': 'шестнадцатое', '17': 'семнадцатое',
        '18': 'восемнадцатое', '19': 'девятнадцатое', '20': 'двадцатое', 21: 'двадцать первое',
        '22':'двадцать второе', '23':'двадцать третье', '24':'двадцать четвертое',
        '25': 'двадцать пятое', '26': 'двадцать шестое', '27': 'двадцать седьмое',
        '28': 'двадцать восьмое', '29': 'двадцать девятое', '30': 'тридцатое', '31': 'тридцать первое'
        }
date = (input('Введите дату в формате дд.мм.гггг')).split('.')
print(days[date[0]], months[date[1]], date[2], 'года')

# Задача-3:
# Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random
import random


my_set = []
n = int(input('Введите количество элементов'))
for unit in range(n):
    my_set.append(random.randint(-100, 100))
print(my_set)


# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]
lst = [1, 2, 4, 5, 6, 2, 5, 2]
lst_2 = []
lst_3 = []
for unit in lst:
    if unit not in lst_2:
        lst_2.append(unit)
print(lst_2)

for unit in lst:
    lst.remove(unit)
    if unit not in lst:
        lst_3.append(unit)
print(lst_3)